"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.botTexts = void 0;
exports.botTexts = {
    measurement: {
        errorId: "Виникла помилка: не знайдено ID редагованого виміру. Будь ласка, почніть спочатку з команди /edit.",
        newMeasurement: "📊 Введіть нові значення для останнього виміру у форматі Тиск/Тиск Пульс (наприклад: 120/80 75)",
        strangeValues: "😬 Значення виходять за розумні межі. Будь ласка, перевірте і введіть знову (наприклад: 120/80 75):",
        invalidValues: "🚫 Невірний формат. \n Будь ласка, введіть дані у форматі Тиск/Тиск Пульс (наприклад: 120/80 75):",
        notFound: "❌ Не знайдено вимірювання для редагування. Можливо, воно було видалено. Почніть з /edit.",
        updatedResults: "✅ Останнє вимірювання успішно оновлено!\n",
        savingError: "❌️ Виникла помилка при збереженні вимірювання. Повторіть спробу пізніше.",
    },
    editProfile: {
        emptyInput: "🚫 Поле не може бути пустим. Спробуйте ще раз.",
        idError: "❌ Не вдалося отримати ваш ID. Зміна неможлива.",
        nameChange: "📝 Починаємо зміну ПІБ.",
        cantFindNote: "❌ Не вдалося знайти ваш запис для редагування. Спробуйте /start.",
        savingError: "❌️ Виникла помилка при збереженні даних. Повторіть спробу пізніше.",
    },
    editSchedule: {
        invalidFormat: "❗️ Невірний формат часу. Введіть час у форматі ГГ:ХХ (наприклад: 08:00):",
        idError: "❌ Не вдалося отримати ваш ID. Зміна неможлива.",
        incorrectUser: "❌ Не вдалося знайти вашу реєстрацію. Спробуйте /start.",
        startChangingTime: "⏱️ Починаємо зміну часу вимірювань",
        updateDbError: "❌ Не вдалось оновити дані в базі даних. Спробуйте пізніше.",
        updateScheduleError: "❌ Виникла помилка при оновленні розкладу. Спробуйте знову пізніше.",
    },
    registration: {
        alreadyRegistered: "😀 Ви вже зареєстровані.",
        start: "Починаємо реєстрацію! Будь ласка, дайте відповідь на кілька запитань.",
        enterName: "1. Введіть ваше ім'я:",
        emptyName: "❌ Поле не може бути пустим. Реєстрація скасована.",
        enterLastName: "2. Введіть ваше призвіще:",
        emptyLastName: "❌ Поле не може бути пустим. Реєстрація скасована.",
        enterPatronymic: '3. Введіть ваше по-батькові (або натисніть "Пропустити"):',
        invalidAnswer: "Неочікувана відповідь. Реєстрація зупинена.",
    },
    editLastMeasurement: {
        search: "🔍 Шукаю останнє вимірювання...",
        registrationError: "Не вдалось знайти вашу реєстрацію. Спробуйте /start.",
        emptyMeasurement: "🤷 У Вас ще немає збережених вимірювань.",
        sessionError: "Виникла внутрішня помилка (сесія не знайдена). \nБудь ласка, спробуйте використати команду /start, а потім знову /edit.",
        measurementIdError: "❌ Помилка: ID вимірювання не збережено в сессію.",
        searchError: "Виникла помилка при пошуку останнього вимірювання. Спробуйте пізніше",
    },
    enterMeasurement: "Будь ласка, введіть вимірювання у форматі Тиск/Тиск Пульс (наприклад: 120/80 75):",
    editCommand: {
        notRegistered: "Ви ще не зареєстровані. Будь ласка використайте команду /register.",
        dataError: "Не вдалося отримати дані для редагування. Спробуйте пізніше.",
    },
    startCommand: {
        welcomeText: "Вітаємо! 👋\n\n Цей бот допоможе вам слідкувати за вашим тиском та пульсом.\n\n. Щоб почати, Вам необхідно" +
            " зареєструватись. Натисніть кнопку нижче, або використайте команду /register.",
        statusError: "Виникла помилка при отриманні статусу користувача. Спробуйте пізніше.",
    },
    measurementValidator: {
        invalidValues: "😬 Здається, введені значення виходять за розумні межи. \n" +
            "Будь ласка, перевірте і введіть знову (наприклад: 120/80 75):",
        registrationError: "❌ Виникла помилка. Не вдалося знайти вашу реєстрацію. Спробуйте команду /start.",
        savingError: "Не вдалось зберегти вимірювання. Спробуйте ще раз.",
        invalidFormat: "❗️ Невірний формат.\n" +
            "Будь ласка, введіть дані у форматі **Тиск/Тиск Пульс** (числа через `/` або пробіл, потім пробіл і пульс).\n" +
            "Наприклад: `120/80 75`",
    },
};
